{"config": [{"config": {"batch_input_shape": [null, 200], "activity_regularizer": null, "dtype": "int32", "embeddings_regularizer": null, "output_dim": 64, "embeddings_constraint": null, "input_length": 200, "input_dim": 100000, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "trainable": true, "mask_zero": false, "name": "embedding_2"}, "class_name": "Embedding"}, {"config": {"merge_mode": "concat", "trainable": true, "layer": {"config": {"dropout": 0.0, "kernel_constraint": null, "return_sequences": false, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "implementation": 0, "trainable": true, "bias_constraint": null, "stateful": false, "recurrent_dropout": 0.0, "kernel_regularizer": null, "unit_forget_bias": true, "activity_regularizer": null, "bias_regularizer": null, "name": "lstm_2", "activation": "tanh", "recurrent_constraint": null, "units": 256, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, "name": "bidirectional_2"}, "class_name": "Bidirectional"}, {"config": {"rate": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "bias_regularizer": null, "activation": "sigmoid", "units": 1, "trainable": true, "bias_constraint": null, "name": "dense_2", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}